o=room3;
hpos(866,0)
//for (z=0;z<32;z++){
//sob('Я ебал твою мамку',0,-1,-1)
//sob(chr(ord('а')+z),0,-1,-1)
//}
sob('нажмите лкм по любой иконке что бы запустить
приложение или игру',object179,-1,-1)
sob('если вы нажмете пкм то вы переменуете ',object179,-1,-1)
sob('вы можете выйти в меню нажав escape ',0,-1,-1)
sob('вы можете перейти в полноэкранный режим и обратно нажав 
F1 в любой комнате ',0,-1,-1)
sob('нажав R вы перезапустите игру в любой комнате ',0,-1,-1)
sob('В этой комнате обучение окончено',0,-1,-1)
o=plotf
sob('Здесь нужно дойти до конца карты живым',object179,-1,-1)
sob('Передвигается персонаж с помощью клавишь W,A,D
W-прыжок
A-влево
D-вправо
',object3,-1,-1)
sob('Вы можете стрельнуть оружием навидя на нужную цель мышкой
и нажав ЛКМ',object3,-1,-1)
sob('Нажав E вы откроете/закроете инвентарь',0,-1,-1)
sob('Нажав H вы включите спец. возможность
(у бяки спецю возможности нет))
',0,-1,-1)
sob('В этой комнате обучение окончено',0,-1,-1)

o=agar_i
sob('Тут нужно не дать себя съесть ботам 
(или игрокам в онлайн режиме) с большим размером и
есть ботов\игроков которые меньше размером',v1,-1,-1)
sob('навидите мышкой туда куда вы хотите передвигаться',v1,-1,-1)
sob('Вы можете разделится нажав пробел',v1,-1,-1)
sob('Вы можете выбрасить шарик нажав W',0,-1,-1)
sob('В этой комнате обучение окончено',0,-1,-1)

o=clicki
hpos(866,0)
sob('Вы можете переключаться между 2 вкладками
(выбраная вкладка та которая горит белым)',object344,-1,-1)
sob('в 1 вкладке показаны ваши люди',object344,20,100)
sob('в 2 вкладке показаны вещи которые вы
можете создать',object344,20,175)
sob('нажав лкм вы отправите 1 рабочего создавать обьект',object346,-1,-1)
sob('нажав пкм вы прекажете 1 рабочему прекращать создавть
 обьект',object346,-1,-1)
sob('это обекты которые вы можете создать
под обьектом написаны 2 числа в виде x(+y),
x обозначает количество имеющихся обьектов
y обозначает количество обьектов производящихся за ход
',object348,-1,-1) 
sob('это обьекты которые требуются для создания обьекта',object349,-1,-1)
sob('цифра показывает сколько требуется что бы произвести предмет
если цифа отрицательна как тут то нужный обьект тратится 1 раз
и возвращается при отмены создания выбраного обьекта',object349,150,125)
sob('если цифа положительна как тут то нужный обьект тратится за каждый 
ход',object349,200,200)
sob('Нажав на эту кнопку вы перейдете на следующий ход',object351,-1,-1)
sob('В этой комнате обучение окончено',0,-1,-1)
o=fru
sob('В этой комнате вам требуется собрирать фрукты',0,-1,-1)
sob('Вы выиграйте когда выполните квест',0,-1,-1)
sob('Что бы собрать фрукты вам нужно выбрать одинаковые фрукты по очередно,
 потом нажать пкм
(нажав ЛКМ вы выбираете фрукты)
(нажав ПКМ вы собираете фрукты)',0,-1,-1)
sob('Чем больше фруктов было собранно за 1 раз, тем лучше',0,-1,-1)
sob('В этой комнате обучение окончено',0,-1,-1)
o=sho
sob('это магазин',0,-1,-1)
sob('здесь вы можите улучшать и выбрать нужного вам 
персонажа',0,-1,-1)
sob('вы можете листать страницы нажав стрелочки влево 
или вправо',0,-1,-1)
sob('выберете нужного героя и нажмите выбрать',object308,-1,-1)
sob('вы можете повысить уровень вашего персонажа, играя
в любую игру, а так же вы можете эволюциоонировать 
героя за повторки персонажа(эволюция возможна при 
достижении определенного уровня)',object309,-1,-1)
sob('Вы можете нажать на эту кнопочку и посмотреть 
характиристики героя за 1 уровень',object312,-1,-1)
sob('В этой комнате обучение окончено',0,-1,-1)
